Tekla Open API Reference for Tekla Structures 2025
BoltItemEnumerator Class
 The BoltItemEnumerator class allows to loop through the bolt catalog items.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.BoltItemEnumerator
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class BoltItemEnumerator : IEnumerator
<SerializableAttribute>
Public NotInheritable Class BoltItemEnumerator
	Implements IEnumerator
The BoltItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a bolt item instance of the current element.
Top
Methods
Name | Description
GetSize
 Returns the total amout of items.
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
Examples
 The following example returns true if an item with the standard A325N has been found:
using Tekla.Structures.Catalogs;
public class Example
{
       public bool Example1()
       {
           bool Result = false;
           CatalogHandler CatalogHandler = new CatalogHandler();
           if (CatalogHandler.GetConnectionStatus())
           {
               BoltItemEnumerator BoltItemEnumerator = CatalogHandler.GetBoltItems();
               while (BoltItemEnumerator.MoveNext())
               {
                   BoltItem BoltItem = BoltItemEnumerator.Current as BoltItem;
                   if (BoltItem.Standard == "A325N")
                   {
                       Result = true;
                       break;
                   }
               }
           }
           return Result;
       }
}
See Also
Reference
Tekla.Structures.Catalogs Namespace